name: "LogReg"
layers {
  name: "sun_train"
  type: DATA
  top: "data"
  top: "label"
  data_param {
    source: "sun_training_01_lmdb_0_start"
    backend: LMDB
    batch_size: 50
  }
  transform_param {
    crop_size: 227
  }
  include: { phase: TRAIN }
}
layers {
  name: "sun_test"
  type: DATA
  top: "data"
  top: "label"
  data_param {
    source: "sun_testing_01_lmdb_0_start"
    backend: LMDB
    batch_size: 50
  }
  transform_param {
    crop_size: 227
  }
  include: { phase: TEST }
}
layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "data"
  top: "ip"
  inner_product_param {
    num_output: 397
  }
}
layers {
  name: "loss"
  type: SOFTMAX
  bottom: "ip"
  top: "loss"
}