name: "LogReg"
input: "data"
input_dim: 50
input_dim: 3
input_dim: 227
input_dim: 227
layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "data"
  top: "ip"
  inner_product_param {
    num_output: 397
  }
}
layers {
  name: "loss"
  type: SOFTMAX
  bottom: "ip"
  top: "loss"
}